import numpy as np
# вводим размеры матрицы
n = int(input("Введите количество строк N: "))
m = int(input("Введите количество столбцов M: "))
b = np.random.randint(1, 10, size=(n, m)) # создаем рандомную матрицу из чисел(с помощью randint  программа сама подберет рандомные числа)
print("Исходная матрица:")
print(b)
c = b.T # транспонированная матрица (c помощью T мы можем найти транспонированную матрицу)
print("Транспонированная матрица:")
print(c)
if n == m: #проверяем квадратная матрица или нет
    det1 = np.linalg.det(b) # определитель первой
    det2 = np.linalg.det(c) # определитель второй
    print("Определитель исходной матрицы:", det1)
    print("Определитель транспонированной матрицы:", det2) 
    if det1 == det2: # сравниваем
        print("Определители равны ")
    else:
        print("Определители разные ")
else:
    print("Матрица не квадратная, определитель посчитать нельзя")
